
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализировать данные документа.
// 
// Параметры:
//  ДокументДополнительныеРасходы - ДокументСсылка.ДополнительныеРасходы - Ссылка на документ "ДополнительныеРасходы"
//  СтруктураДополнительныеСвойства - Структура - дополнительные свойства
Процедура ИнициализироватьДанныеДокумента(ДокументДополнительныеРасходы, ДополнительныеСвойства) Экспорт  
	
	ТаблицаДополнительныеРасходы = ДанныеТаблицаДополнительныеРасходы(ДокументДополнительныеРасходы, ДополнительныеСвойства);
		
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеРасходы", ТаблицаДополнительныеРасходы);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеТаблицаДополнительныеРасходы(ДокументДополнительныеРасходы, СтруктураДополнительныеСвойства)  
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументДополнительныеРасходы.Ссылка КАК Ссылка,
	               |	ДокументДополнительныеРасходы.Дата КАК Период,
	               |	ДокументДополнительныеРасходы.ТипРасходов КАК ТипРасходов,
	               |	ДокументДополнительныеРасходы.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ДополнительныеРасходы КАК ДокументДополнительныеРасходы
	               |ГДЕ
	               |	ДокументДополнительныеРасходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументДополнительныеРасходы);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
