#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Процедура ЗаписатьТарифУченикаПоУроку(Урок) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ученик.Установить(Урок);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Тариф = Урок.Тариф;
	НоваяЗапись.Ученик = Урок.Ссылка;
    НоваяЗапись.Период = ТекущаяДатаСеанса();
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("При записи тарифа ученика произошла ошибка. Подробное описание: %1", ПодробноеПредставлениеОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
