#Область ПрограммныйИнтерфейс  

Функция ПрибыльЗаПериод(НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БалансУченикаОбороты.СуммаПриход КАК СуммаПриход
	               |ИЗ
	               |	РегистрНакопления.БалансУченика.Обороты(&НачалоПериода, &КонецПериода, , ) КАК БалансУченикаОбороты";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ПрибыльЗаПериод = 0;
	
	Если Выборка.Следующий() Тогда
	     ПрибыльЗаПериод = Выборка.СуммаПриход;
	КонецЕсли;
	 
	Возврат ПрибыльЗаПериод;

КонецФункции

#КонецОбласти
