#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс  

Функция ПрибыльЗаПериод(НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БалансУченикаОбороты.СуммаПриход КАК СуммаПриход
	               |ИЗ
	               |	РегистрНакопления.БалансУченика.Обороты(&НачалоПериода, &КонецПериода, , ) КАК БалансУченикаОбороты";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ПрибыльЗаПериод = 0;
	
	Если Выборка.Следующий() Тогда
	     ПрибыльЗаПериод = Выборка.СуммаПриход;
	КонецЕсли;
	 
	Возврат ПрибыльЗаПериод;

КонецФункции

&НаСервере
Функция БалансУченика(Ученик) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	БалансУченикаОстатки.Ученик КАК Ученик,
	               |	БалансУченикаОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.БалансУченика.Остатки КАК БалансУченикаОстатки
	               |ГДЕ
	               |	БалансУченикаОстатки.Ученик = &Ученик";  
	
	Запрос.УстановитьПараметр("Ученик", Ученик);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Баланс = 0;
	
	Если Выборка.Следующий() Тогда 
		
		Баланс = Выборка.СуммаОстаток;
		
	КонецЕсли;
	
	Возврат Баланс;
	
КонецФункции

#КонецОбласти

#КонецЕсли
