
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализировать данные документа.
// 
// Параметры:
//  ДокументПоступлениеДС - ДокументСсылка.ПоступлениеДС - Ссылка на документ "ПоступлениеДС"
//  СтруктураДополнительныеСвойства - Структура - дополнительные свойства
Процедура ИнициализироватьДанныеДокумента(ДокументПоступлениеДС, ДополнительныеСвойства) Экспорт  
	
	ТаблицаБалансУченика = ДанныеТаблицаБалансУченика(ДокументПоступлениеДС, ДополнительныеСвойства);
		
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБалансУченика", ТаблицаБалансУченика);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеТаблицаБалансУченика(ДокументПоступлениеДС, СтруктураДополнительныеСвойства)  
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеДС.Ссылка КАК Ссылка,
	               |	ПоступлениеДС.Дата КАК Период,
	               |	ПоступлениеДС.Ученик КАК Ученик,
				   |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ПоступлениеДС.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПоступлениеДС КАК ПоступлениеДС
	               |ГДЕ
	               |	ПоступлениеДС.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументПоступлениеДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
