
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область ОбработчикиСобытий 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.ПоступлениеДС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	ПроведениеДокументов.ОтразитьДвижения("БалансУченика", ТаблицыДляДвижений, Движения, Отказ);
	
	ПроведениеДокументов.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Ученики") Тогда
		ЗаполнитьДокументНаОснованииКарточкиУченика(ДанныеЗаполнения);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьДокументНаОснованииКарточкиУченика(ДанныеЗаполнения)
	
	Ученик = ДанныеЗаполнения.Ссылка;
	
КонецПроцедуры
	
#КонецЕсли