
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТекущаяДата.Заголовок = Формат(ТекущаяДатаСеанса(), "Л=ru_RU; ДЛФ=DD");
	ПериодОтчета = Формат(ТекущаяДата(), "ДФ=MMMM.гггг");
	ДатаОтчета = ТекущаяДата();
	РассчитатьПоказателиЗаПериод();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура РассчитатьПоказателиЗаПериод()
	
    ПроведеноУроков = Документы.Уроки.КоличествоУроковЗаПериод(НачалоМесяца(ДатаОтчета), КонецМесяца(ДатаОтчета));
	Заработано = РегистрыНакопления.БалансУченика.ПрибыльЗаПериод(НачалоМесяца(ДатаОтчета), КонецМесяца(ДатаОтчета));
	СуммаНалога = Заработано * 0.04;
	ЧистаяПрибыль = Заработано - СуммаНалога - ДополнительныеРасходы;
	
КонецПроцедуры

#КонецОбласти
