
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализировать данные документа.
// 
// Параметры:
//  ДокументУрок - ДокументСсылка.Уроки - Ссылка на документ "Урок"
//  СтруктураДополнительныеСвойства - Структура - дополнительные свойства
Процедура ИнициализироватьДанныеДокумента(ДокументУрок, ДополнительныеСвойства) Экспорт  
	
	ТаблицаБалансУченика = ДанныеТаблицаБалансУченика(ДокументУрок, ДополнительныеСвойства);
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБалансУченика", ТаблицаБалансУченика);
	
КонецПроцедуры	

Функция КоличествоУроковЗаПериод(НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Уроки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Уроки КАК Уроки
	               |ГДЕ
	               |	Уроки.Дата <= &КонецПериода
	               |	И Уроки.Дата >= &НачалоПериода"; 
				   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Если Выгрузка.Количество() = 0 Тогда
		КоличествоУроков = 0;
	Иначе
		КоличествоУроков = Выгрузка.Количество()
	КонецЕсли;
	
	Возврат КоличествоУроков;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеТаблицаБалансУченика(ДокументУрок, СтруктураДополнительныеСвойства)  
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Уроки.Ученик КАК Ученик,
	               |	Уроки.Дата КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	Уроки.ЭтоПробныйУрок КАК ЭтоПробныйУрок
	               |ПОМЕСТИТЬ ВТ_ДанныеУрока
	               |ИЗ
	               |	Документ.Уроки КАК Уроки
	               |ГДЕ
	               |	Уроки.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТарифыУчениковСрезПоследних.Ученик КАК Ученик,
	               |	ВТ_ДанныеУрока.Период КАК Период,
	               |	ВТ_ДанныеУрока.ВидДвижения КАК ВидДвижения,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеУрока.ЭтоПробныйУрок
	               |			ТОГДА (ЗНАЧЕНИЕ(Справочник.Тарифы.Пробный)).Цена
	               |		ИНАЧЕ ТарифыУчениковСрезПоследних.Тариф.Цена
	               |	КОНЕЦ КАК Сумма
	               |ИЗ
	               |	ВТ_ДанныеУрока КАК ВТ_ДанныеУрока
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыУчеников.СрезПоследних КАК ТарифыУчениковСрезПоследних
	               |		ПО ВТ_ДанныеУрока.Ученик = ТарифыУчениковСрезПоследних.Ученик";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументУрок);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
