
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция РасчетТекущегоВремениУченика(ЧасовойПояс) Экспорт
	
	Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
		РазницаВремени = СмещениеСтандартногоВремени(ЧасовойПояс.Наименование) - СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
	КонецЕсли;
	
	ВремяУченика = ТекущаяДатаСеанса() + РазницаВремени;
	
	Возврат ВремяУченика;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
    Поля.Добавить("UTC");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Представление = СтрШаблон("%1 %2", Данные.UTC, Данные.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
