
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсторияУроков.Параметры.УстановитьЗначениеПараметра("Ученик", Объект.Ссылка);  
	ИсторияОплат.Параметры.УстановитьЗначениеПараметра("Ученик", Объект.Ссылка);
	
	Баланс = РегистрыНакопления.БалансУченика.БалансУченика(Объект.Ссылка);
	
	ТекущееВремяУченика = Справочники.ЧасовыеПояса.РасчетТекущегоВремениУченика(Объект.ЧасовойПояс);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда Возврат КонецЕсли;
	РегистрыСведений.ТарифыУчеников.ЗаписатьТарифУченикаПоУроку(Объект.Ссылка);	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНовыйУрок(Команда)

	ЭлементыОтбора = Новый Структура("Ученик", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Документ.Уроки.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПополнитьБалансУченика(Команда) 
	
	ЭлементыОтбора = Новый Структура("Ученик", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Документ.ПоступлениеДС.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
