#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область ОбработчикиСобытий 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.Уроки.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений; 
	
	Если НЕ СтатусУрока = Перечисления.СтатусыУрока.Запланирован Тогда
		ПроведениеДокументов.ОтразитьДвижения("БалансУченика", ТаблицыДляДвижений, Движения, Отказ);
	КонецЕсли;  
		
КонецПроцедуры

#КонецОбласти
	
	
#КонецЕсли